[
"Try to do a cartwheel while juggling 3 balls",
"Call a random contact from your phone and tell them a funny story.",
"Take a selfie with a funny face and post it on social media.",
"Try to balance an egg on your nose for 10 seconds.",
"Do a 1-minute stand-up comedy routine in a silly voice.",
"Wear a sock as a scarf for the next hour.",
"Wear a sock as a glove for the next hour.",
"Text your best friend that you're starting a llama farm (then tell them it's a dare).",
"Text your crush and ask them if they believe in ghosts.",
"Do a 3-minute workout routine.",
"Do the chicken dance in public.",
"Call a random number and sing 'I Will Always Love You' by Whitney Houston.",
"Try to fit as many marshmallows in your mouth as you can.",
"Send a text message to a family member saying you're running away to join the circus (then tell them it's a dare).",
"Put on a silly costume for the next round.",
"Put on a blindfold and let someone choose a song for you to dance to.",
"Put on oven mitts and try to tie your shoes with them.",
"Pretend to be a ballerina until your next turn.",
"Put on a silly mask and wear it for the rest of the game.",
"Call a local hardware store and ask if they sell magic wands.",
"Post a flirty comment on the first Instagram picture that you see.",
"Put on a blindfold and let someone feed you a mystery food.",
"Call a friend and try to convince them to do something ridiculous.",
"Do 20 jumping jacks in public.",
"Do a handstand for 10 seconds.",
"Wear someone else’s hat for the rest of the game.",
"Eat a spoonful of cinnamon (be careful, this can be dangerous).",
"Text your crush and ask them if they believe in time travel.",
"Dance to a song chosen by the group.",
"Call a random fast-food restaurant and ask if they have a unicorn burger.",
"Pretend to be underwater for the next 10 minutes.",
"Go outside and do the moonwalk dance in public.",
"Call a local pharmacy and ask if they sell invisibility potions.",
"Do a dramatic reading of a random Wikipedia page.",
"Text your best friend that you're adopting a pet sloth (then tell them it's a dare).",
"Impersonate a famous person.",
"Trade clothes with another player.",
"Text your best friend that you're moving to Antarctica (then tell them it's a dare).",
"Eat a spoonful of hot sauce.",
"Let everyone go through your Snapchat history.",
"Put on a crazy wig and wear it for the rest of the game.",
"Put on socks on your hands and try to eat something with them.",
"Text your crush and ask them if they believe in leprechauns.",
"Somersault.",
"Call a local toy store and ask if they sell magic beans.",
"Put makeup on someone else in the group.",
"Let everyone pose you in an embarrassing position and post a picture to Instagram.",
"Try to balance a spoon on your nose and walk across the room.",
"Give the person to your right a foot massage (with their consent).",
"Send a text message to a family member saying you're joining the circus (then tell them it's a dare).",
"Put on a blindfold and let someone choose a song for you to sing karaoke.",
"Go outside and do the Macarena dance in public.",
"Text your best friend that you're becoming a professional clown (then tell them it's a dare).",
"Wear your clothes inside out for the next hour.",
"Try to hula hoop for 1 minute."
        ]
