[
    "What's the most embarrassing thing you've done to get someone's attention?",
"What's the most embarrassing thing you've done while trying to impress a crush?",
"Have you ever lied about your age?",
"What's the most embarrassing thing you've done to avoid paying for something?",
"Have you ever pretended to be someone else online to troll or prank someone?",
"What's the most embarrassing thing you've done in a chatroom or online game?",
"What's your guilty pleasure?",
"Have you ever had an embarrassing moment during a school assembly?",
"Have you ever had an embarrassing moment during a job interview?",
"Have you ever lied to yours?",
"What's the most embarrassing thing you've done in front of your boss?",
"Have you ever stolen someone’s identity or used someone else’s information?",
"What’s the most outrageous thing you’ve ever done to get out of trouble?",
"Have you ever had a crush on someone your best friend liked?",
"Have you ever spread a rumor about someone?",
"What's a secret talent you have that no one knows about?",
"What's the most embarrassing thing you've done while trying to impress someone?",
"What's the most embarrassing thing you've done at a birthday party?",
"Have you ever had a one-night stand?",
"What’s the most embarrassing thing that ever happened to you at a party?",
"Have you ever had an embarrassing moment in a public restroom?",
"What's the most embarrassing thing you've done during a phone call?",
"Have you ever lied to get a job or promotion?",
"What's the most embarrassing thing you've done to avoid a conversation?",
"What’s the most embarrassing thing that has happened to you in public?",
"Have you ever lied about your name to avoid being recognized?",
"What's the weirdest dream you've ever had?",
"What’s the most embarrassing thing that’s ever happened to you in front of a celebrity?",
"What’s the most outrageous lie you’ve ever told your partner?",
"Have you ever had a crush on someone you met online?",
"What’s the most embarrassing thing that ever happened to you on a date?",
"What's the most awkward date you've ever been on?",
"Have you ever had a crush on a celebrity?",
"If you could switch lives with anyone for a day, who would it be?",
"What’s the ridiculous thing you’ve ever lied about?",
"Have you ever stalked someone on social media?",
"What’s the biggest mistake you’ve ever made?",
"What's the most illegal thing you've ever done?",
"Have you ever had a near-death experience?",
"What is the most embarrassing thing you’ve done in front of someone you like?",
"What's the most embarrassing thing you've done for a dare?",
"What's the most embarrassing thing you've done to get out of a commitment?",
"Have you ever had a crush on someone from your workplace?",
"Have you ever cheated on a test or exam?",
"What’s the most embarrassing thing that ever happened to you in front of your crush?",
"What's the most embarrassing thing you've done to impress a celebrity?",
"What's the most embarrassing thing you've done while trying to be cool?",
"What's the most trouble you've ever gotten into?",
"Have you ever been caught picking your nose?",
"Have you ever had a crush on a cartoon character or fictional character?",
"Have you ever cheated on a significant other?",
"Have you ever lied about your relationship status to get out of a date?",
"What's the most embarrassing song on your playlist?",
"Have you ever cheated on a partner?",
"What's the most embarrassing thing you've done to avoid a confrontation?",
"What’s the most outrageous thing you’ve ever done to get a date?",
"What's the most embarrassing thing you've done to get a job or promotion?",
"Have you ever stolen someone’s significant other?",
"Have you ever cheated on a board game?",
"What’s the most illegal thing you’ve ever done?",
"Have you ever lied to get out of a commitment?",
"Have you ever cheated in a game?",
"What's the most embarrassing lie you've ever been caught in?",
"Have you ever snooped through someone else's phone or computer?",
"What's the grossest thing you've ever eaten?",
"Have you ever gotten into a physical fight?",
"What's the most embarrassing thing you've done while trying to flirt?",
"What's the most embarrassing thing you've done during a family gathering?",
"What’s your most embarrassing moment?",
"What's the most embarrassing thing you've done in a movie theater?",
"Have you ever cheated on a job application or resume?",
"Have you ever lied about your skills or qualifications?",
"What's the most embarrassing thing you've done at a party?",
"What's the most embarrassing thing your parents have caught you doing?",
"What's the most childish thing you still do as an adult?",
"Who was your first crush?",
"Have you ever been stood up on a date?",
"What's the most embarrassing thing you've done to get out of a family gathering?",
"Have you ever lied to get out of doing something you didn’t want to do?",
"Have you ever read someone else's diary or journal?",
"Have you ever shoplifted?",
"What's the most embarrassing thing you've said in front of your crush?",
"What's the most embarrassing thing you've done while trying to impress your boss?",
"Have you ever pretended to like something just to fit in with a group of friends?",
"What's the most embarrassing thing you've done to avoid a confrontation with a friend?",
"Have you ever lied about your age to get into a club?",
"Have you ever pretended to like a gift when you actually didn't?",
"Have you ever peed in a public place when you weren't supposed to?",
"Have you ever pretended to be interested in something just to get someone to like you?",
"Have you ever faked being sick to avoid going to school or work?",
"Have you ever spread a rumor that turned out to be false?",
"Have you ever stolen anything?",
"What's the most embarrassing text message you've sent by mistake?",
"What's the most embarrassing thing in your internet search history?",
"Have you ever stolen someone's food?",
"What's the most embarrassing thing you've done to get a discount or freebie?",
"What's the most embarrassing thing you've done during a virtual meeting?",
"What's the most embarrassing thing you've done at a family reunion?",
"What's the most embarrassing thing you've done on a vacation?",
"Have you ever stolen something from a store or business?",
"What’s the most selfish thing you’ve ever done?",
"Have you ever been caught checking yourself out in the mirror?",
"What's the most embarrassing thing you've posted on social media and later regretted?",
"Have you ever lied to get out of trouble?",
"What's the most embarrassing thing you've done on a school field trip?",
"What's the most embarrassing thing you've done to get revenge on someone?",
"What's your biggest pet peeve?",
"What's the most embarrassing thing you've done in a gym?",
"Have you ever broken someone's heart?",
"Have you ever faked an injury or illness to get out of a situation?",
"Have you ever sent a text message to the wrong person?",
"Have you ever had a crush on a friend's sibling?",
"What's the most embarrassing thing you've done at a wedding?",
"What's the most embarrassing thing you've done to get a favor from someone?",
"Have you ever had a crush on someone much older or younger than you?",
"What's your biggest regret?",
"What's the most embarrassing thing you've posted on social media?",
"What’s the wildest thing you’ve ever done?",
"Have you ever cheated on an online test or quiz?",
"What's the most embarrassing thing you've done while drunk?",
"Have you ever had an embarrassing moment during a presentation?",
"Have you ever lied to a friend to avoid hanging out with them?",
"What's the most embarrassing thing you've done to get someone to buy you a drink?",
"Have you ever regretted breaking up with someone?",
"What's the most embarrassing thing you've done while trying to impress someone's parents?",
"Have you ever had a crush on a friend’s significant other?",
"Have you ever cheated in a relationship?",
"What is your biggest secret?",
"What's the most embarrassing thing you've done while trying to be funny?",
"What’s the biggest lie you’ve ever told your best friend?",
"Have you ever had a secret crush on someone for a long time without telling them?",
"Have you ever had a paranormal experience?",
"Have you ever faked a compliment just to be polite?",
"What's the most embarrassing thing you've done while eavesdropping on someone?",
"Have you ever had a crush on someone in this room?",
"Have you ever pretended to know something you had no clue about?",
"Have you ever lied to your parents?",
"Have you ever had a crush on a teacher?",
"What's the most embarrassing thing that has happened to you?",
"Have you ever had a crush on a friend's ex?",
"Have you ever had an embarrassing moment in front of a crowd?",
"Have you ever had a wardrobe malfunction?",
"Have you ever pretended to be someone else on a dating app or website?",
"Have you ever lied about your identity online?",
"What's the most embarrassing thing you've done while meeting your partner's family?",
"What's the most embarrassing thing you've said in a text message to the wrong person?",
"Have you ever cheated in a competition?",
"Have you ever lied to your parents about where you were going?",
"Have you ever cheated on a tax return or other government document?",
"Have you ever lied about your relationship status?",
"Have you ever pretended to be sick to avoid something you didn't want to do?",
"Have you ever had a crush on a neighbor?",
"What's the most embarrassing thing you've done at work?",
"What's the most embarrassing thing you've worn?",
"Have you ever cheated on a test?",
"What's the most adventurous thing you've ever done?",
"Have you ever been caught talking to yourself?",
"What's the worst gift you've ever received?",
"Have you ever been in a physical fight?",
"What's the most embarrassing thing you've done during a class presentation?",
"Have you ever been caught lying to your partner?",
"What’s the most irresponsible thing you’ve ever done?",
"Have you ever pretended to be interested in someone just to get something from them?",
"Have you ever lied to your boss or coworker?",
"What’s the most embarrassing thing that’s ever happened to you in front of your family?",
"Have you ever stolen someone else’s idea or work and passed it off as your own?",
"What's the most embarrassing thing you've done to get out of a social obligation?",
"What's the most embarrassing thing you've done during a job interview?",
"What's your biggest fear?",
"Have you ever had a crush on a stranger?",
"What's the most embarrassing thing you've done to get out of trouble with the law?",
"Have you ever pretended to be someone else to get into an event or party?",
"What's the most embarrassing thing you've done on a date?",
"What’s the most outrageous thing you’ve ever done for attention?",
"What's the most embarrassing thing you've done to avoid a confrontation with a stranger?",
"What's the most embarrassing thing you've done to get out of a wedding or party?",
"What's the most embarrassing thing you've done in public?",
"Have you ever stolen money from a friend or family member?",
"What's the most embarrassing nickname you've been given?",
"What's the most embarrassing thing you've done during a Skype or Zoom call?",
"Have you ever skipped school or work without a valid excuse?",
"Have you ever been in love?",
"Have you ever lied on your resume?",
"What's the most embarrassing thing you've done to get attention on social media?",
"What’s the most embarrassing thing that ever happened to you at a wedding?",
"What’s the most embarrassing thing that’s ever happened to you during a workout?"
]
